# Робота з типом даних "множина" в Python

# Задання множини з елементами-числами:
num_set = {1, 2, 3, 4, 5, 6}
print(num_set)
# {1, 2, 3, 4, 5, 6}

# Задання значення множини з елементами-рядками:
string_set = {"Nicholas", "Michelle", "John", "Mercy"}
print(string_set)
# {'Michelle', 'Mercy', 'John', 'Nicholas'}

# Створення множини зі списку:
num_set = set([1, 2, 3, 4, 5, 6])
print(num_set)
# {1, 2, 3, 4, 5, 6}

# Створення множини зі списку назв місяців та перевірка приналежності множини до елемента:
months = set(["Jan", "Feb", "March", "Apr", "May", "June",
             "July", "Aug", "Sep", "Oct", "Nov", "Dec"])
# Чи належить елемент "May" множині months
print("May" in months)
# True

# Об'єднання множин

# Приклад об'єднання двох множин з елементами-рядками:
# Об'єднання множин з елементами рядками
months_a = set(["Jan", "Feb", "March", "Apr", "May", "June"])
months_b = set(["July", "Aug", "Sep", "Oct", "Nov", "Dec"])
all_months = months_a.union(months_b)
print(all_months)
# {'March', 'Jan', 'Nov', 'Feb', 'Oct', 'Sep', 'Apr', 'Dec', 'Aug', 'July', 'June', 'May'}

# Приклад об'єднання трьох множин з елементами-числами:
# Об'єднання множин з елементами числами
x = {1, 2, 3}
y = {4, 3, 6}
z = {7, 4, 9}
print(x | y | z)
# {1, 2, 3, 4, 6, 7, 9}

# Перетин множин
# Приклад коду, що реалізує виведення результату перетину множин:
x = {1, 2, 3}
y = {4, 3, 6}
print(x & y)  # Результат: 3
# {3}

# Різниця між множинами
# А таким чином можна отримати результат різниці множин a і b:
set_a = {1, 2, 3, 4, 5}
set_b = {4, 5, 6, 7, 8}
diff_set = set_a.difference(set_b)
print(diff_set)
# {1, 2, 3}

# Симетрична різниця між множинами
set_a = {1, 2, 3, 4, 5}
set_b = {4, 5, 6, 7, 8}
print(set_a ^ set_b)
# {1, 2, 3, 6, 7, 8}
